[
  {
    "name": "12795К",
    "answer": "35",
    "text": "Определите количество строк, в которых содержится число, равное целой части среднего арифметического всех чисел в строке."
  },
  {
    "name": "5798п",
    "answer": "49",
    "text": "Определите, какое количество четвёрок удовлетворяют условию, что наибольшее число является делителем произведения остальных."
  },
  {
    "name": "5707К",
    "answer": "0",
    "text": "Определите количество строк, в которых сумма квадратов трёх минимальных чисел больше произведения трёх максимальных."
  },
  {
    "name": "8365",
    "answer": "3",
    "text": "Определите количество строк, в которых все числа различны и можно выбрать две пары чисел так, чтобы среднее арифметическое каждой пары было равно оставшемуся числу."
  },
  {
    "name": "4321К",
    "answer": "1056",
    "text": "Определите количество строк таблицы, в которых сумма кубов любых двух чисел больше квадрата суммы оставшихся трех."
  },
  {
    "name": "5523",
    "answer": "665",
    "text": "Определите количество строк, в которых выполнены оба условия: хотя бы одно число повторяется дважды (ровно 2 раза); каждое из повторяющихся дважды чисел превышает каждое неповторяющееся."
  },
  {
    "name": "3887К",
    "answer": "1035",
    "text": "Определите количество строк, в которых хотя бы 3 числа больше среднего арифметического всех чисел в строке."
  },
  {
    "name": "23747",
    "answer": "901",
    "text": "Определите сумму чисел в строке с наибольшим номером, для которой выполнены оба условия: в строке есть одно число, которое повторяется трижды, остальные четыре числа различны; среднее арифметическое неповторяющихся чисел строки не больше повторяющегося числа."
  },
  {
    "name": "9832К",
    "answer": "261",
    "text": "Определите сумму всех чисел в строке таблицы с наименьшим номером, для чисел которой выполнены оба условия: в строке есть два числа, каждое из которых повторяется дважды, остальные три числа различны; максимальное число строки не повторяется."
  },
  {
    "name": "9778К",
    "answer": "34",
    "text": "Определите наименьший номер строки таблицы, для чисел которой выполнены оба условия: в строке есть только одно число, которое повторяется дважды, остальные четыре числа различны; повторяющееся число строки не меньше, чем среднее арифметическое четырёх её неповторяющихся чисел."
  },
  {
    "name": "8497К",
    "answer": "не указан",
    "text": "Определите количество строк, в которых все числа различны и утроенная сумма минимального и максимального чисел строки не меньше, чем удвоенная сумма трёх её оставшихся чисел."
  },
  {
    "name": "9696К",
    "answer": "125",
    "text": "Определите количество строк, в которых только одно число встречается в строке дважды, сумма двух самых больших чисел строки более чем в два раза больше суммы двух самых малых, максимальное число строки не кратно минимальному."
  },
  {
    "name": "6564П",
    "answer": "265",
    "text": "Иван удалил из каждой строки одно число, значение которого совпадает с максимальным значением в этой строке и еще одно число, значение которого совпадает с минимальным значением в этой строке. Назовем строку особой, если после удаления модуль разности оставшихся в этой строке чисел кратен минимальному значению в строке до удаления. Определите количество особых строк."
  },
  {
    "name": "6593П",
    "answer": "10",
    "text": "Определите количество строк, в которых квадрат наибольшего значения больше произведения остальных чисел и сумма двух наибольших значений как минимум вдвое больше суммы остальных значений в строке."
  },
  {
    "name": "4985П",
    "answer": "893",
    "text": "Сколько среди них строк, в которых квадратный корень произведения максимального и минимального чисел в строке больше кубического корня из произведения трех оставшихся?"
  },
  {
    "name": "18134",
    "answer": "4278",
    "text": "Определите количество строк, в которых два числа, которые повторяются дважды, остальные числа различны, квадрат большего из повторяющихся больше произведения неповторяющихся, и произведение всех повторяющихся чисел строки более чем вдвое превосходит произведение неповторяющихся чисел."
  },
  {
    "name": "5627К",
    "answer": "525",
    "text": "Определите количество строк, в которых выполнено хотя бы одно из условий: в строке есть хотя бы одно повторяющееся число; будучи упорядоченными, все числа строки образуют арифметическую прогрессию."
  },
  {
    "name": "7335",
    "answer": "1151",
    "text": "Определите количество строк, которые удовлетворяют только одному из следующих критериев: В строке нет повторяющихся чисел, а целочисленное среднее арифметическое максимального и минимального чисел присутствует в строке; В строке есть повторяющиеся числа, и сумма квадратов этих чисел меньше суммы квадратов неповторяющихся чисел."
  },
  {
    "name": "6628п",
    "answer": "482",
    "text": "Определите количество строк, для которых выполнено ровно одно из следующих условий: одно число повторяется дважды, остальные числа различны; сумма всех нечетных значений больше суммы четных значений (если чисел с определенным признаком четности нет, то считаем сумму равной нулю)."
  },
  {
    "name": "12726К",
    "answer": "15293",
    "text": "Найдите наибольший номер строки таблицы, для чисел которой выполнены оба условия: в строке есть одно число, которое повторяется трижды, остальные числа различны; количество чётных чисел превышает количество нечётных."
  },
  {
    "name": "9539к",
    "answer": "2",
    "text": "Определите количество строк, в которых есть две пары повторяющихся значений и неповторяющееся число больше значений одной пары и меньше значений другой."
  },
  {
    "name": "5524",
    "answer": "12",
    "text": "Определите количество строк, в которых ровно два числа не повторяются и среднее геометрическое повторяющихся чисел не меньше произведения неповторяющихся чисел строки."
  },
  {
    "name": "12490К",
    "answer": "349",
    "text": "Определите количество строк, в которых есть ровно одно число, которое повторяется дважды, а остальные числа различны, и максимальное число строки повторяется столько же раз, сколько и минимальное."
  },
  {
    "name": "5783п",
    "answer": "53",
    "text": "Определите количество строк, где нет повторяющихся чисел и хотя бы одно произведение двух любых чисел равно кубу целого числа."
  },
  {
    "name": "12797",
    "answer": "53",
    "text": "Определите количество строк, в которых есть только одно число, которое повторяется дважды, остальные два числа различны, все неповторяющиеся числа нечетны, повторяющиеся числа чётны."
  },
  {
    "name": "6141",
    "answer": "86",
    "text": "Определите количество строк, в которых нет повторяющихся чисел, чётных чисел меньше, чем нечётных, и сумма чётных чисел больше, чем сумма нечётных."
  },
  {
    "name": "18174",
    "answer": "не указан",
    "text": "Определите количество строк, в которых только одно число повторяется дважды, остальные числа различны, и сумма всех отрицательных чисел строки по модулю больше суммы всех положительных чисел в этой строке."
  }
]